/**
 * TestDemo
 * Factory.java
 */
package com.example;


import java.lang.annotation.ElementType;
import java.lang.annotation.Retention;
import java.lang.annotation.RetentionPolicy;
import java.lang.annotation.Target;

/**
 * @author Administrator
 * @since 2017/2/14 14:27
 * @version 1.0
 */
@Retention(RetentionPolicy.CLASS)
//TYPE 才能修饰类
@Target(ElementType.TYPE)
public @interface Factory {
    // ===========================================================
    // Constants
    // ===========================================================
    Class<?> type();
    String id();

    // ===========================================================
    // Fields
    // ===========================================================


    // ===========================================================
    // Constructors
    // ===========================================================


    // ===========================================================
    // Getter &amp; Setter
    // ===========================================================


    // ===========================================================
    // Methods for/from SuperClass/Interfaces
    // ===========================================================


    // ===========================================================
    // Methods
    // ===========================================================


    // ===========================================================
    // Inner and Anonymous Classes
    // ===========================================================

}
